In [1]:
import pandas as pd
import numpy as np

## 1. Creating a DataFrame from an Array

### 1.1 Option-1

In [5]:
# creating an array
data = np.array([[1,3], [2,4], [6,8], [5,10]])

In [11]:
# creating a data frame 
indexes = ['row1', 'row2', 'row3','row4']
columns = ['col1', 'col2']
data_df = pd.DataFrame(data, index=indexes,columns=columns)

In [12]:
# showing the data frame
data_df

      col1  col2
row1     1     3
row2     2     4
row3     6     8
row4     5    10

### 1.2 Option-2

In [15]:
# Creating an array with list shape
data = [[11,13], [12,14], [16,18]]

In [16]:
# creating a data frame 
indexes = ['row1', 'row2', 'row3']
columns = ['col1', 'col2']
data_df = pd.DataFrame(data, index=indexes, columns=columns)

In [17]:
# showing the data frame
data_df

      col1  col2
row1    11    13
row2    12    14
row3    16    18

## 2. Creating a DataFrame from a dictionary

In [26]:
# lists used for this Example
cities = ["Tokyo","Yokohama","Osaka","Nagoya"]
population = [14195730, 3772726, 2788758, 2331078]

In [27]:
# storing lists within the dictionary
data_dict = {'Cities': cities, 'Population': population}

In [28]:
# creating DataFrame
df = pd.DataFrame(data_dict)

In [29]:
df

     Cities  Population
0     Tokyo    14195730
1  Yokohama     3772726
2     Osaka     2788758
3    Nagoya     2331078

## Creating DataFrame from CSV file

In [3]:
# reading from the CSV file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [4]:
# Show the first 5 rows in a DataFrame
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75